base/InformationRegisters/бит_НастройкиОбъектовВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиОбъектовВизирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьВизирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимОбновленияВиз</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыОбновленияПеречняВиз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимКонтроляВложений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_РежимыОбновленияПеречняВиз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыОбновленияПеречняВиз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбновлятьПриПерепроведении</Name>
					<Comment>Обновлять при перепроведении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбновлять</Name>
					<Comment>Не обновлять</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_НастройкиОбъектовВизирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиОбъектовВизированияПоУмолчанию() Экспорт
	
	ИменаОбъектовВизирования = Новый Массив;
	ТипыОбъектовВизирования = Метаданные.ОпределяемыеТипы.бит_ОбъектыВизирования.Тип.Типы();
	Для каждого ТипОбъекта Из ТипыОбъектовВизирования Цикл
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипОбъекта);
		ИменаОбъектовВизирования.Добавить(МетаданныеОбъекта.ПолноеИмя());
	КонецЦикла;
	
	МодульВизирование  = бит_ВизированиеСервер.МодульВизированияПереопределяемый();
	ОтключенныеОбъекты = МодульВизирование.ОбъектыВизированияОтлюченныеПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыСистемы.Ссылка КАК ОбъектСистемы,
	|	ВЫБОР
	|		КОГДА ОбъектыСистемы.ИмяОбъектаПолное В (&ОтключенныеОбъекты)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользоватьВизирование,
	|	ЗНАЧЕНИЕ(Перечисление.бит_РежимыОбновленияПеречняВиз.ПоУмолчанию) КАК РежимОбновленияВиз,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыКонтроля.НеКонтролировать) КАК РежимКонтроляВложений
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиОбъектовВизирования КАК НастроенныеОбъекты
	|		ПО ОбъектыСистемы.Ссылка = НастроенныеОбъекты.ОбъектСистемы
	|ГДЕ
	|	ОбъектыСистемы.ИмяОбъектаПолное В(&ИменаОбъектовВизирования)
	|	И НЕ ОбъектыСистемы.ПометкаУдаления
	|	И НастроенныеОбъекты.ОбъектСистемы ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ИменаОбъектовВизирования", ИменаОбъектовВизирования);
	Запрос.УстановитьПараметр("ОтключенныеОбъекты", ОтключенныеОбъекты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.бит_НастройкиОбъектовВизирования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
